src/Catalogs/ВидыТарифовСтраховыхВзносовУНФ/ВидыТарифовСтраховыхВзносовУНФ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыТарифовСтраховыхВзносовУНФ</name>
  <predefined>
    <items>
      <name>БлаготворительныеОрганизации</name>
      <description>Благотворительные организации</description>
    </items>
    <items>
      <name>ДляОтраслейПострадавшихОтКоронавируснойИнфекции</name>
      <description>Для отраслей, пострадавших от коронавирусной инфекции</description>
    </items>
    <items>
      <name>ДляСубъектовМалогоПредпринимательства</name>
      <description>Для субъектов малого или среднего предпринимательства</description>
    </items>
    <items>
      <name>ДляФармацевтовАптек</name>
      <description>Для фармацевтов аптек</description>
    </items>
    <items>
      <name>ДляЧленовЭкипажейМорскихСудовПодФлагомРФ</name>
      <description>Для членов экипажей морских судов под флагом РФ</description>
    </items>
    <items>
      <name>ИндивидуальныйПредпринимательПрименяющийПатент</name>
      <description>Индивидуальный предприниматель, применяющий патент</description>
    </items>
    <items>
      <name>НекоммерческиеОрганизации</name>
      <description>Некоммерческие организации</description>
    </items>
    <items>
      <name>СМИ</name>
      <description>Организации - средства массовой информации</description>
    </items>
    <items>
      <name>ОрганизацииЗанимающиесяОбщепитом</name>
      <description>Организации и ИП, занимающиеся общепитом</description>
    </items>
    <items>
      <name>ОрганизацияИнвалидов</name>
      <description>Организации инвалидов</description>
    </items>
    <items>
      <name>НародныеХудожественныеПромыслы</name>
      <description>Организации народных художественных промыслов и семейных (родовых) общин</description>
    </items>
    <items>
      <name>Мультипликаторы</name>
      <description>Организации-производители анимации</description>
    </items>
    <items>
      <name>ОрганизацииРазработчикиЭлектроннойПродукции</name>
      <description>Организации-разработчики электронной продукции</description>
    </items>
    <items>
      <name>СельХозПроизводители</name>
      <description>Организации-с/х производители, применяющие ОСН</description>
    </items>
    <items>
      <name>ЕСХН</name>
      <description>Организации-с/х производители, уплачивающие ЕСХН</description>
    </items>
    <items>
      <name>ОрганизацииКурильскихОстровов</name>
      <description>Организации, зарегистрированные на Курильских островах</description>
    </items>
    <items>
      <name>ОрганизацииОказывающиеИнжиниринговыеУслуги</name>
      <description>Организации, оказывающие инжиниринговые услуги</description>
    </items>
    <items>
      <name>ИнновационныеНаучноТехнологическиеЦентры</name>
      <description>Организации, получившие статус участников инновационных научно-технологических центров</description>
    </items>
    <items>
      <name>УпрощенныйНалоговыйРежимПроизводство</name>
      <description>Организации, применяющие УСН, занятые производством и приравненными видами деятельности</description>
    </items>
    <items>
      <name>ITОрганизации</name>
      <description>Организации, работающие в области информационных технологий</description>
    </items>
    <items>
      <name>ОбщийНалоговыйРежим</name>
      <description>Основной тариф страховых взносов</description>
    </items>
    <items>
      <name>УпрощенныйНалоговыйРежим</name>
      <description>Основной тариф, организации или ИП на УСН</description>
    </items>
    <items>
      <name>ЕНВД</name>
      <description>Основной тариф, организации или ИП, уплачивающие ЕНВД</description>
    </items>
    <items>
      <name>ДляСтудентовВСтудотрядах</name>
      <description>По доходам студентов в студотрядах</description>
    </items>
    <items>
      <name>РезидентОсобойЗоныВКалининградскойОбласти</name>
      <description>Резидент особой зоны в Калининградской области</description>
    </items>
    <items>
      <name>РезидентТерриторииОпережающегоСоциальноЭкономическогоРазвития</name>
      <description>Резидент территории опережающего социально-экономического развития</description>
    </items>
    <items>
      <name>РезидентПортаВладивосток</name>
      <description>Резиденты свободного порта Владивосток</description>
    </items>
    <items>
      <name>РезидентТехникоВнедренческойЗоны</name>
      <description>Резиденты технико-внедренческой особой экономической зоны</description>
    </items>
    <items>
      <name>АУСН</name>
      <description>Страхователи, применяющие Автоматизированную УСН</description>
    </items>
    <items>
      <name>УчастникПроектаИнновационныйЦентрСколково</name>
      <description>Участник проекта инновационный центр &quot;Сколково&quot;</description>
    </items>
    <items>
      <name>УчастникОсобойЗоныВКрыму</name>
      <description>Участник свободной экономической зоны в Крыму</description>
    </items>
    <items>
      <name>УчастникСпециальныхАдминистративныхРайонов</name>
      <description>Участник специальных административных районов</description>
    </items>
    <items>
      <name>ХозОбществаБюджетныхВУЗов</name>
      <description>Хозяйственные общества, созданные бюджетными научными учреждениями и ВУЗами</description>
    </items>
  </predefined>
  <attributes>
    <name>ИдентификаторОбъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПФР2011</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодФСС2011</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодФНС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПФР2012</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодФСС2012</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПрименяетсяПоОтдельнымДоходам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <comment>АПК:58 различия имени и синонима оправданы</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЯвляетсяТерриториальнымТарифом</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьИдентификаторОбъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЯвляетсяТарифомДляМСП</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/ВидыТарифовСтраховыхВзносовУНФ/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

 // Возвращает реквизиты справочника, которые образуют естественный ключ
//  для элементов справочника.
//
// Возвращаемое значение: Массив(Строка) - массив имен реквизитов, образующих
//  естественный ключ.
//
Функция ПоляЕстественногоКлюча() Экспорт
	
	Результат = Новый Массив();
	
	Результат.Добавить("Наименование");
	Результат.Добавить("ПометкаУдаления");
	
	Возврат Результат;
	
КонецФункции
	
#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВидыТарифовСтраховыхВзносовУНФ.Ссылка КАК Ссылка,
	|	ВидыТарифовСтраховыхВзносовУНФ.Наименование КАК Наименование
	|ИЗ
	|	Справочник.ВидыТарифовСтраховыхВзносовУНФ КАК ВидыТарифовСтраховыхВзносовУНФ
	|ГДЕ &УсловиеЗапроса
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВидыТарифовСтраховыхВзносовУНФ.РеквизитДопУпорядочивания";
	
	УсловиеЗапроса = "";

	ПараметрыДляДоступныхТарифов = Справочники.ВидыТарифовСтраховыхВзносовУНФ.ПараметрыДляДоступныхТарифов(Параметры);
	ВидОрганизации = ПараметрыДляДоступныхТарифов.ВидОрганизации;
	ПрименяетсяУСН = ПараметрыДляДоступныхТарифов.ПрименяетсяУСН;
	ПрименяетсяПоОтдельнымДоходам = ПараметрыДляДоступныхТарифов.ПрименяетсяПоОтдельнымДоходам;
	ЯвляетсяТерриториальнымТарифом = ПараметрыДляДоступныхТарифов.ЯвляетсяТерриториальнымТарифом;
	
	Если ЗначениеЗаполнено(ВидОрганизации) Или ЗначениеЗаполнено(ПрименяетсяУСН) Или ЗначениеЗаполнено(ПрименяетсяПоОтдельнымДоходам) Тогда
	
		ДоступныеТарифыСтраховыхВзносов = УчетСтраховыхВзносовУНФ.ДоступныеТарифыСтраховыхВзносов(ВидОрганизации, ПрименяетсяУСН, ПрименяетсяПоОтдельнымДоходам);
		
		Запрос.УстановитьПараметр("ДоступныеТарифыСтраховыхВзносов", ДоступныеТарифыСтраховыхВзносов);
		
		Если ЗначениеЗаполнено(ЯвляетсяТерриториальнымТарифом) Тогда
			УсловиеЗапроса = "ГДЕ
							  |	ВидыТарифовСтраховыхВзносовУНФ.Ссылка В (&ДоступныеТарифыСтраховыхВзносов)
							  |	И ВидыТарифовСтраховыхВзносовУНФ.ЯвляетсяТерриториальнымТарифом";
			
		ИначеЕсли ЗначениеЗаполнено(ПрименяетсяПоОтдельнымДоходам) И ПрименяетсяПоОтдельнымДоходам Тогда
			УсловиеЗапроса = "ГДЕ
							  |	ВидыТарифовСтраховыхВзносовУНФ.Ссылка В (&ДоступныеТарифыСтраховыхВзносов)";
		Иначе
			УсловиеЗапроса = "ГДЕ
							  |	ВидыТарифовСтраховыхВзносовУНФ.Ссылка В (&ДоступныеТарифыСтраховыхВзносов)
							  |	И НЕ ВидыТарифовСтраховыхВзносовУНФ.ПрименяетсяПоОтдельнымДоходам";
		КонецЕсли;
	
	ИначеЕсли ЗначениеЗаполнено(ЯвляетсяТерриториальнымТарифом) Тогда
			УсловиеЗапроса = "ГДЕ
							  |	ВидыТарифовСтраховыхВзносовУНФ.ЯвляетсяТерриториальнымТарифом";
	КонецЕсли;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ГДЕ &УсловиеЗапроса", УсловиеЗапроса);
	Выборка = Запрос.Выполнить().Выбрать();
	
	ДанныеВыбора = Новый СписокЗначений;
	Пока Выборка.Следующий() Цикл
		ДанныеВыбора.Добавить(Выборка.Ссылка, Выборка.Наименование);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
	
#Область СлужебныеПроцедурыИФункции

Функция ПараметрыДляДоступныхТарифов(Параметры) Экспорт
	
	ПараметрыДляДоступныхТарифов = Новый Структура("ВидОрганизации, ПрименяетсяУСН, ПрименяетсяПоОтдельнымДоходам, ЯвляетсяТерриториальнымТарифом", Неопределено, Неопределено, Неопределено, Неопределено);
	
	Организация = Неопределено;
	Параметры.Свойство("Организация", Организация);
	
	Период = Неопределено;
	Параметры.Свойство("Период",Период);
	
	ПрименяетсяУСН = Неопределено;
	Параметры.Свойство("ПрименяетсяУСН", ПрименяетсяУСН);
	
	ПрименяетсяПоОтдельнымДоходам = Неопределено;
	Параметры.Отбор.Свойство("ПрименяетсяПоОтдельнымДоходам",ПрименяетсяПоОтдельнымДоходам);
	
	ЯвляетсяТерриториальнымТарифом = Неопределено;
	Параметры.Отбор.Свойство("ЯвляетсяТерриториальнымТарифом",ЯвляетсяТерриториальнымТарифом);
	
	Если ЗначениеЗаполнено(Организация) ИЛИ ЗначениеЗаполнено(ПрименяетсяУСН) ИЛИ ЗначениеЗаполнено(Период) ИЛИ ЗначениеЗаполнено(ПрименяетсяПоОтдельнымДоходам) ИЛИ ЗначениеЗаполнено(ЯвляетсяТерриториальнымТарифом) Тогда
		
		ВидОрганизации = Неопределено;
		Если ЗначениеЗаполнено(Организация) Тогда
			ВидОрганизации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организация, "ЮридическоеФизическоеЛицо");
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ПрименяетсяУСН) И ЗначениеЗаполнено(Организация) И ЗначениеЗаполнено(Период) Тогда
			ПрименяетсяУСН = РегламентированнаяОтчетностьУСН.ПрименяетсяУСН(Организация, Период);
		КонецЕсли;
		
		ПараметрыДляДоступныхТарифов.ВидОрганизации = ВидОрганизации;
		ПараметрыДляДоступныхТарифов.ПрименяетсяУСН = ПрименяетсяУСН;
		ПараметрыДляДоступныхТарифов.ПрименяетсяПоОтдельнымДоходам = ПрименяетсяПоОтдельнымДоходам;
		ПараметрыДляДоступныхТарифов.ЯвляетсяТерриториальнымТарифом = ЯвляетсяТерриториальнымТарифом;
		
	КонецЕсли;
	
	Возврат ПараметрыДляДоступныхТарифов;
	
КонецФункции

Процедура НачальноеЗаполнение() Экспорт
	
	СоздатьВидыТарифовСтраховыхВзносов();
	ЗаполнитьКодыВидовТарифаСтраховыхВзносов_2012();
	УточнитьПараметрыВидовТарифовСтраховыхВзносов();
	ОписатьТарифПредпринимателяПрименяющегоПатент();
	ВписатьКодыТарифов2015Года();
	ОписатьТарифРезидентаПортаВладивосток();
	ВписатьКодыФНС();
	ОписатьТарифМультипликаторов();
	ОписатьКалининградскийТариф();
	ОтметитьТерриториальныеТарифы();
	ОписатьОффшорныйТариф();
	ОписатьТарифМалогоПредпринимательства();
	ОписатьНулевойКоронавирусныйТариф();
	ОписатьТарифРазработчиковЭлектроннойПродукции();
	ОписатьТарифы2022();
	ОписатьТарифОрганизацийКурильскихОстровов();
	ОписатьТарифАУСН();
	ОписатьТарифСтудентов();
	ОписатьТарифыМСП();
	
КонецПроцедуры

// АПК:1327-выкл Начальное заполнение ИБ, исключительная управляемая блокировка на записываемые данные не нужна

Процедура СоздатьВидыТарифовСтраховыхВзносов()

	СписокОписанийТарифов = Новый Массив;
	
	Описание = ОписаниеТарифа();
	Описание.Идентификатор = "ОбщийНалоговыйРежим";
	Описание.Наименование = НСтр("ru='Основной тариф страховых взносов'");
	Описание.КодПФР2011 = "01";
	Описание.КодФСС2011 = "071";
	СписокОписанийТарифов.Добавить(Описание);

	Описание = ОписаниеТарифа();
	Описание.Идентификатор = "УпрощенныйНалоговыйРежим";
	Описание.Наименование = НСтр("ru='Основной тариф, организации или ИП на УСН'");
	Описание.КодПФР2011 = "51";
	Описание.КодФСС2011 = "071";
	СписокОписанийТарифов.Добавить(Описание);
	
	Описание = ОписаниеТарифа();
	Описание.Идентификатор = "ЕНВД";
	Описание.Наименование = НСтр("ru='Основной тариф, организации или ИП, уплачивающие ЕНВД'");
	Описание.КодПФР2011 = "51";
	Описание.КодФСС2011 = "071";
	СписокОписанийТарифов.Добавить(Описание);
	
	Описание = ОписаниеТарифа();
	Описание.Идентификатор = "СельХозПроизводители";
	Описание.Наименование = НСтр("ru='Организации-с/х производители, применяющие ОСН'");
	Описание.КодПФР2011 = "02";
	Описание.КодФСС2011 = "041";
	СписокОписанийТарифов.Добавить(Описание);
	
	Описание = ОписаниеТарифа();
	Описание.Идентификатор = "НародныеХудожественныеПромыслы";
	Описание.Наименование = НСтр("ru='Организации народных художественных промыслов и семейных (родовых) общин'");
	Описание.КодПФР2011 = "02";
	Описание.КодФСС2011 = "071";
	СписокОписанийТарифов.Добавить(Описание);
	
	Описание = ОписаниеТарифа();
	Описание.Идентификатор = "ОрганизацияИнвалидов";
	Описание.Наименование = НСтр("ru='Организации инвалидов'");
	Описание.КодПФР2011 = "03";
	Описание.КодФСС2011 = "061";
	СписокОписанийТарифов.Добавить(Описание);
	
	Описание = ОписаниеТарифа();
	Описание.Идентификатор = "ЕСХН";
	Описание.Наименование = НСтр("ru='Организации-с/х производители, уплачивающие ЕСХН'");
	Описание.КодПФР2011 = "04";
	Описание.КодФСС2011 = "032";
	СписокОписанийТарифов.Добавить(Описание);
	
	Описание = ОписаниеТарифа();
	Описание.Идентификатор = "ITОрганизации";
	Описание.Наименование = НСтр("ru='Организации, работающие в области информационных технологий'");
	Описание.КодПФР2011 = "06";
	Описание.КодФСС2011 = "091";
	СписокОписанийТарифов.Добавить(Описание);
	
	Описание = ОписаниеТарифа();
	Описание.Идентификатор = "УпрощенныйНалоговыйРежимПроизводство";
	Описание.Наименование = НСтр("ru='Организации, применяющие УСН, занятые производством и приравненными видами деятельности'");
	Описание.КодПФР2011 = "07";
	Описание.КодФСС2011 = "071";
	СписокОписанийТарифов.Добавить(Описание);
	
	Описание = ОписаниеТарифа();
	Описание.Идентификатор = "ХозОбществаБюджетныхВУЗов";
	Описание.Наименование = НСтр("ru='Хозяйственные общества, созданные бюджетными научными учреждениями и ВУЗами'");
	Описание.КодПФР2011 = "08";
	Описание.КодФСС2011 = "101";
	СписокОписанийТарифов.Добавить(Описание);
	
	Описание = ОписаниеТарифа();
	Описание.Идентификатор = "СМИ";
	Описание.Наименование = НСтр("ru='Организации - средства массовой информации'");
	Описание.КодПФР2011 = "09";
	Описание.КодФСС2011 = "111";
	СписокОписанийТарифов.Добавить(Описание);                         
	
	Описание = ОписаниеТарифа();
	Описание.Идентификатор = "УчастникПроектаИнновационныйЦентрСколково";
	Описание.Наименование = НСтр("ru='Участник проекта инновационный центр Сколково'");
	Описание.КодПФР2011 = "10";
	Описание.КодФСС2011 = "081";
	СписокОписанийТарифов.Добавить(Описание);
	
	Описание = ОписаниеТарифа();
	Описание.Идентификатор = "ДляФармацевтовАптек";
	Описание.Наименование = НСтр("ru='Для фармацевтов аптек'");
	Описание.КодПФР2011 = "";
	Описание.КодФСС2011 = "";
	СписокОписанийТарифов.Добавить(Описание);
	
	Описание = ОписаниеТарифа();
	Описание.Идентификатор = "НекоммерческиеОрганизации";
	Описание.Наименование = НСтр("ru='Некоммерческие организации'");
	Описание.КодПФР2011 = "";
	Описание.КодФСС2011 = "";
	СписокОписанийТарифов.Добавить(Описание);
	
	Описание = ОписаниеТарифа();
	Описание.Идентификатор = "БлаготворительныеОрганизации";
	Описание.Наименование = НСтр("ru='Благотворительные организации'");
	Описание.КодПФР2011 = "";
	Описание.КодФСС2011 = "";
	СписокОписанийТарифов.Добавить(Описание);
	
	Описание = ОписаниеТарифа();
	Описание.Идентификатор = "ОрганизацииОказывающиеИнжиниринговыеУслуги";
	Описание.Наименование = НСтр("ru='Организации, оказывающие инжиниринговые услуги'");
	Описание.КодПФР2011 = "";
	Описание.КодФСС2011 = "";
	СписокОписанийТарифов.Добавить(Описание);
			
	Описание = ОписаниеТарифа();
	Описание.Идентификатор = "ДляЧленовЭкипажейМорскихСудовПодФлагомРФ";
	Описание.Наименование = НСтр("ru='Для членов экипажей морских судов под флагом РФ'");
	Описание.КодПФР2011 = "";
	Описание.КодФСС2011 = "";
	СписокОписанийТарифов.Добавить(Описание);
	
	Описание = ОписаниеТарифа();
	Описание.Идентификатор = "ИндивидуальныйПредпринимательПрименяющийПатент";
	Описание.Наименование = НСтр("ru='Индивидуальный предприниматель, применяющий патент'");
	Описание.КодПФР2011 = "";
	Описание.КодФСС2011 = "";
	СписокОписанийТарифов.Добавить(Описание);
	
	Описание = ОписаниеТарифа();
	Описание.Идентификатор = "РезидентТехникоВнедренческойЗоны";
	Описание.Наименование = НСтр("ru='Резиденты технико-внедренческой особой экономической зоны'");
	Описание.КодПФР2011 = "36";
	Описание.КодФСС2011 = "051";
	СписокОписанийТарифов.Добавить(Описание);
	
	Описание = ОписаниеТарифа();
	Описание.Идентификатор = "УчастникОсобойЗоныВКрыму";
	Описание.Наименование = НСтр("ru='Участник свободной экономической зоны в Крыму'");
	Описание.КодПФР2011 = "";
	Описание.КодФСС2011 = "";
	СписокОписанийТарифов.Добавить(Описание);
	
	Описание = ОписаниеТарифа();
	Описание.Идентификатор = "РезидентТерриторииОпережающегоСоциальноЭкономическогоРазвития";
	Описание.Наименование = НСтр("ru='Резидент территории опережающего социально-экономического развития'");
	Описание.КодПФР2011 = "";
	Описание.КодФСС2011 = "";
	СписокОписанийТарифов.Добавить(Описание);
	
	Описание = ОписаниеТарифа();
	Описание.Идентификатор = "РезидентПортаВладивосток";
	Описание.Наименование = НСтр("ru='Резиденты свободного порта Владивосток'");
	Описание.КодПФР2011 = "";
	Описание.КодФСС2011 = "";
	СписокОписанийТарифов.Добавить(Описание);
	
	Описание = ОписаниеТарифа();
	Описание.Идентификатор = "Мультипликаторы";
	Описание.Наименование = НСтр("ru='Организации-производители анимации'");
	Описание.КодПФР2011 = "";
	Описание.КодФСС2011 = "";
	СписокОписанийТарифов.Добавить(Описание);
	
	Описание = ОписаниеТарифа();
	Описание.Идентификатор = "РезидентОсобойЗоныВКалининградскойОбласти";
	Описание.Наименование = НСтр("ru='Резидент особой зоны в Калининградской области'");
	Описание.КодПФР2011 = "";
	Описание.КодФСС2011 = "";
	СписокОписанийТарифов.Добавить(Описание);
	
	Счетчик = 1;
	Для каждого ОписаниеТарифа Из СписокОписанийТарифов Цикл
		
		СсылкаПредопределенного = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыТарифовСтраховыхВзносовУНФ." + ОписаниеТарифа.Идентификатор);
		Если ЗначениеЗаполнено(СсылкаПредопределенного) Тогда
			ВидТарифаОбъект = СсылкаПредопределенного.ПолучитьОбъект();
		Иначе
			ВидТарифаОбъект = Справочники.ВидыТарифовСтраховыхВзносовУНФ.СоздатьЭлемент();
			ВидТарифаОбъект.ИмяПредопределенныхДанных = ОписаниеТарифа.Идентификатор;
		КонецЕсли;

		Если ВидТарифаОбъект.РеквизитДопУпорядочивания <> Счетчик Тогда
			
			ВидТарифаОбъект.Наименование = ОписаниеТарифа.Наименование;
			ВидТарифаОбъект.КодПФР2011 = ОписаниеТарифа.КодПФР2011;
			ВидТарифаОбъект.КодФСС2011 = ОписаниеТарифа.КодФСС2011;
			ВидТарифаОбъект.РеквизитДопУпорядочивания = Счетчик;
			ВидТарифаОбъект.ОбменДанными.Загрузка = Истина;
			ВидТарифаОбъект.ДополнительныеСвойства.Вставить("ЗаписьОбщихДанных");
			ВидТарифаОбъект.Записать();
			
		КонецЕсли;
			
		Счетчик = Счетчик + 1;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьКодыВидовТарифаСтраховыхВзносов_2012()
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВидыТарифовСтраховыхВзносовУНФ.Ссылка,
	|	""01"" КАК КодПФР2012,
	|	""071"" КАК КодФСС2012
	|ИЗ
	|	Справочник.ВидыТарифовСтраховыхВзносовУНФ КАК ВидыТарифовСтраховыхВзносовУНФ
	|ГДЕ
	|	ВидыТарифовСтраховыхВзносовУНФ.Ссылка = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносовУНФ.ОбщийНалоговыйРежим)
	|	И ВидыТарифовСтраховыхВзносовУНФ.КодПФР2012 = """"
	|	И ВидыТарифовСтраховыхВзносовУНФ.КодФСС2012 = """"
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВидыТарифовСтраховыхВзносовУНФ.Ссылка,
	|	""18"",
	|	""041""
	|ИЗ
	|	Справочник.ВидыТарифовСтраховыхВзносовУНФ КАК ВидыТарифовСтраховыхВзносовУНФ
	|ГДЕ
	|	ВидыТарифовСтраховыхВзносовУНФ.Ссылка = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносовУНФ.СельХозПроизводители)
	|	И ВидыТарифовСтраховыхВзносовУНФ.КодПФР2012 = """"
	|	И ВидыТарифовСтраховыхВзносовУНФ.КодФСС2012 = """"
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВидыТарифовСтраховыхВзносовУНФ.Ссылка,
	|	""52"",
	|	""071""
	|ИЗ
	|	Справочник.ВидыТарифовСтраховыхВзносовУНФ КАК ВидыТарифовСтраховыхВзносовУНФ
	|ГДЕ
	|	ВидыТарифовСтраховыхВзносовУНФ.Ссылка = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносовУНФ.УпрощенныйНалоговыйРежим)
	|	И ВидыТарифовСтраховыхВзносовУНФ.КодПФР2012 = """"
	|	И ВидыТарифовСтраховыхВзносовУНФ.КодФСС2012 = """"
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВидыТарифовСтраховыхВзносовУНФ.Ссылка,
	|	""04"",
	|	""032""
	|ИЗ
	|	Справочник.ВидыТарифовСтраховыхВзносовУНФ КАК ВидыТарифовСтраховыхВзносовУНФ
	|ГДЕ
	|	ВидыТарифовСтраховыхВзносовУНФ.Ссылка = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносовУНФ.ЕСХН)
	|	И ВидыТарифовСтраховыхВзносовУНФ.КодПФР2012 = """"
	|	И ВидыТарифовСтраховыхВзносовУНФ.КодФСС2012 = """"
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВидыТарифовСтраховыхВзносовУНФ.Ссылка,
	|	""53"",
	|	""071""
	|ИЗ
	|	Справочник.ВидыТарифовСтраховыхВзносовУНФ КАК ВидыТарифовСтраховыхВзносовУНФ
	|ГДЕ
	|	ВидыТарифовСтраховыхВзносовУНФ.Ссылка = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносовУНФ.ЕНВД)
	|	И ВидыТарифовСтраховыхВзносовУНФ.КодПФР2012 = """"
	|	И ВидыТарифовСтраховыхВзносовУНФ.КодФСС2012 = """"
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВидыТарифовСтраховыхВзносовУНФ.Ссылка,
	|	""03"",
	|	""061""
	|ИЗ
	|	Справочник.ВидыТарифовСтраховыхВзносовУНФ КАК ВидыТарифовСтраховыхВзносовУНФ
	|ГДЕ
	|	ВидыТарифовСтраховыхВзносовУНФ.Ссылка = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносовУНФ.ОрганизацияИнвалидов)
	|	И ВидыТарифовСтраховыхВзносовУНФ.КодПФР2012 = """"
	|	И ВидыТарифовСтраховыхВзносовУНФ.КодФСС2012 = """"
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВидыТарифовСтраховыхВзносовУНФ.Ссылка,
	|	""36"",
	|	""051""
	|ИЗ
	|	Справочник.ВидыТарифовСтраховыхВзносовУНФ КАК ВидыТарифовСтраховыхВзносовУНФ
	|ГДЕ
	|	ВидыТарифовСтраховыхВзносовУНФ.Ссылка = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносовУНФ.РезидентТехникоВнедренческойЗоны)
	|	И ВидыТарифовСтраховыхВзносовУНФ.КодПФР2012 = """"
	|	И ВидыТарифовСтраховыхВзносовУНФ.КодФСС2012 = """"
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВидыТарифовСтраховыхВзносовУНФ.Ссылка,
	|	""10"",
	|	""081""
	|ИЗ
	|	Справочник.ВидыТарифовСтраховыхВзносовУНФ КАК ВидыТарифовСтраховыхВзносовУНФ
	|ГДЕ
	|	ВидыТарифовСтраховыхВзносовУНФ.Ссылка = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносовУНФ.УчастникПроектаИнновационныйЦентрСколково)
	|	И ВидыТарифовСтраховыхВзносовУНФ.КодПФР2012 = """"
	|	И ВидыТарифовСтраховыхВзносовУНФ.КодФСС2012 = """"
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВидыТарифовСтраховыхВзносовУНФ.Ссылка,
	|	""06"",
	|	""091""
	|ИЗ
	|	Справочник.ВидыТарифовСтраховыхВзносовУНФ КАК ВидыТарифовСтраховыхВзносовУНФ
	|ГДЕ
	|	ВидыТарифовСтраховыхВзносовУНФ.Ссылка = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносовУНФ.ITОрганизации)
	|	И ВидыТарифовСтраховыхВзносовУНФ.КодПФР2012 = """"
	|	И ВидыТарифовСтраховыхВзносовУНФ.КодФСС2012 = """"
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВидыТарифовСтраховыхВзносовУНФ.Ссылка,
	|	""08"",
	|	""101""
	|ИЗ
	|	Справочник.ВидыТарифовСтраховыхВзносовУНФ КАК ВидыТарифовСтраховыхВзносовУНФ
	|ГДЕ
	|	ВидыТарифовСтраховыхВзносовУНФ.Ссылка = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносовУНФ.ХозОбществаБюджетныхВУЗов)
	|	И ВидыТарифовСтраховыхВзносовУНФ.КодПФР2012 = """"
	|	И ВидыТарифовСтраховыхВзносовУНФ.КодФСС2012 = """"
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВидыТарифовСтраховыхВзносовУНФ.Ссылка,
	|	""07"",
	|	""121""
	|ИЗ
	|	Справочник.ВидыТарифовСтраховыхВзносовУНФ КАК ВидыТарифовСтраховыхВзносовУНФ
	|ГДЕ
	|	ВидыТарифовСтраховыхВзносовУНФ.Ссылка = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносовУНФ.УпрощенныйНалоговыйРежимПроизводство)
	|	И ВидыТарифовСтраховыхВзносовУНФ.КодПФР2012 = """"
	|	И ВидыТарифовСтраховыхВзносовУНФ.КодФСС2012 = """"
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВидыТарифовСтраховыхВзносовУНФ.Ссылка,
	|	""09"",
	|	""071""
	|ИЗ
	|	Справочник.ВидыТарифовСтраховыхВзносовУНФ КАК ВидыТарифовСтраховыхВзносовУНФ
	|ГДЕ
	|	ВидыТарифовСтраховыхВзносовУНФ.Ссылка = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносовУНФ.СМИ)
	|	И ВидыТарифовСтраховыхВзносовУНФ.КодПФР2012 = """"
	|	И ВидыТарифовСтраховыхВзносовУНФ.КодФСС2012 = """"
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВидыТарифовСтраховыхВзносовУНФ.Ссылка,
	|	""19"",
	|	""042""
	|ИЗ
	|	Справочник.ВидыТарифовСтраховыхВзносовУНФ КАК ВидыТарифовСтраховыхВзносовУНФ
	|ГДЕ
	|	ВидыТарифовСтраховыхВзносовУНФ.Ссылка = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносовУНФ.НародныеХудожественныеПромыслы)
	|	И ВидыТарифовСтраховыхВзносовУНФ.КодПФР2012 = """"
	|	И ВидыТарифовСтраховыхВзносовУНФ.КодФСС2012 = """"
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВидыТарифовСтраховыхВзносовУНФ.Ссылка,
	|	""15"",
	|	""131""
	|ИЗ
	|	Справочник.ВидыТарифовСтраховыхВзносовУНФ КАК ВидыТарифовСтраховыхВзносовУНФ
	|ГДЕ
	|	ВидыТарифовСтраховыхВзносовУНФ.Ссылка = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносовУНФ.ДляЧленовЭкипажейМорскихСудовПодФлагомРФ)
	|	И ВидыТарифовСтраховыхВзносовУНФ.КодПФР2012 = """"
	|	И ВидыТарифовСтраховыхВзносовУНФ.КодФСС2012 = """"
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВидыТарифовСтраховыхВзносовУНФ.Ссылка,
	|	""11"",
	|	""141""
	|ИЗ
	|	Справочник.ВидыТарифовСтраховыхВзносовУНФ КАК ВидыТарифовСтраховыхВзносовУНФ
	|ГДЕ
	|	ВидыТарифовСтраховыхВзносовУНФ.Ссылка = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносовУНФ.ДляФармацевтовАптек)
	|	И ВидыТарифовСтраховыхВзносовУНФ.КодПФР2012 = """"
	|	И ВидыТарифовСтраховыхВзносовУНФ.КодФСС2012 = """"
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВидыТарифовСтраховыхВзносовУНФ.Ссылка,
	|	""12"",
	|	""151""
	|ИЗ
	|	Справочник.ВидыТарифовСтраховыхВзносовУНФ КАК ВидыТарифовСтраховыхВзносовУНФ
	|ГДЕ
	|	ВидыТарифовСтраховыхВзносовУНФ.Ссылка = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносовУНФ.НекоммерческиеОрганизации)
	|	И ВидыТарифовСтраховыхВзносовУНФ.КодПФР2012 = """"
	|	И ВидыТарифовСтраховыхВзносовУНФ.КодФСС2012 = """"
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВидыТарифовСтраховыхВзносовУНФ.Ссылка,
	|	""13"",
	|	""161""
	|ИЗ
	|	Справочник.ВидыТарифовСтраховыхВзносовУНФ КАК ВидыТарифовСтраховыхВзносовУНФ
	|ГДЕ
	|	ВидыТарифовСтраховыхВзносовУНФ.Ссылка = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносовУНФ.БлаготворительныеОрганизации)
	|	И ВидыТарифовСтраховыхВзносовУНФ.КодПФР2012 = """"
	|	И ВидыТарифовСтраховыхВзносовУНФ.КодФСС2012 = """"
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВидыТарифовСтраховыхВзносовУНФ.Ссылка,
	|	""14"",
	|	""071""
	|ИЗ
	|	Справочник.ВидыТарифовСтраховыхВзносовУНФ КАК ВидыТарифовСтраховыхВзносовУНФ
	|ГДЕ
	|	ВидыТарифовСтраховыхВзносовУНФ.Ссылка = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносовУНФ.ОрганизацииОказывающиеИнжиниринговыеУслуги)
	|	И ВидыТарифовСтраховыхВзносовУНФ.КодПФР2012 = """"
	|	И ВидыТарифовСтраховыхВзносовУНФ.КодФСС2012 = """"";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ВидТарифаОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ЗаполнитьЗначенияСвойств(ВидТарифаОбъект,Выборка,,"Ссылка");
		ВидТарифаОбъект.ДополнительныеСвойства.Вставить("ЗаписьОбщихДанных");
		ВидТарифаОбъект.Записать();
	КонецЦикла;

КонецПроцедуры	

Процедура УточнитьПараметрыВидовТарифовСтраховыхВзносов()

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("УпрощенныйНалоговыйРежимНаименование", НСтр("ru='Основной тариф, организации или ИП на УСН'"));
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВидыТарифовСтраховыхВзносовУНФ.Ссылка КАК Ссылка,
	|	ВидыТарифовСтраховыхВзносовУНФ.ПрименяетсяПоОтдельнымДоходам КАК ПрименяетсяПоОтдельнымДоходам,
	|	&УпрощенныйНалоговыйРежимНаименование КАК Наименование
	|ИЗ
	|	Справочник.ВидыТарифовСтраховыхВзносовУНФ КАК ВидыТарифовСтраховыхВзносовУНФ
	|ГДЕ
	|	ВидыТарифовСтраховыхВзносовУНФ.Ссылка = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносовУНФ.УпрощенныйНалоговыйРежим)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВидыТарифовСтраховыхВзносовУНФ.Ссылка,
	|	ИСТИНА,
	|	ВидыТарифовСтраховыхВзносовУНФ.Наименование
	|ИЗ
	|	Справочник.ВидыТарифовСтраховыхВзносовУНФ КАК ВидыТарифовСтраховыхВзносовУНФ
	|ГДЕ
	|	ВидыТарифовСтраховыхВзносовУНФ.Ссылка = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносовУНФ.ЕНВД)
	|	И НЕ ВидыТарифовСтраховыхВзносовУНФ.ПрименяетсяПоОтдельнымДоходам
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВидыТарифовСтраховыхВзносовУНФ.Ссылка,
	|	ИСТИНА,
	|	ВидыТарифовСтраховыхВзносовУНФ.Наименование
	|ИЗ
	|	Справочник.ВидыТарифовСтраховыхВзносовУНФ КАК ВидыТарифовСтраховыхВзносовУНФ
	|ГДЕ
	|	ВидыТарифовСтраховыхВзносовУНФ.Ссылка = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносовУНФ.ДляЧленовЭкипажейМорскихСудовПодФлагомРФ)
	|	И НЕ ВидыТарифовСтраховыхВзносовУНФ.ПрименяетсяПоОтдельнымДоходам
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВидыТарифовСтраховыхВзносовУНФ.Ссылка,
	|	ИСТИНА,
	|	ВидыТарифовСтраховыхВзносовУНФ.Наименование
	|ИЗ
	|	Справочник.ВидыТарифовСтраховыхВзносовУНФ КАК ВидыТарифовСтраховыхВзносовУНФ
	|ГДЕ
	|	ВидыТарифовСтраховыхВзносовУНФ.Ссылка = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносовУНФ.ДляФармацевтовАптек)
	|	И НЕ ВидыТарифовСтраховыхВзносовУНФ.ПрименяетсяПоОтдельнымДоходам";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ВидТарифаОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ЗаполнитьЗначенияСвойств(ВидТарифаОбъект,Выборка,,"Ссылка");
		ВидТарифаОбъект.ДополнительныеСвойства.Вставить("ЗаписьОбщихДанных");
		ВидТарифаОбъект.Записать();
	КонецЦикла;

КонецПроцедуры

Процедура ОписатьТарифПредпринимателяПрименяющегоПатент()

	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВидыТарифовСтраховыхВзносовУНФ.Ссылка,
	|	""16"" КАК КодПФР2012,
	|	""041"" КАК КодФСС2012
	|ИЗ
	|	Справочник.ВидыТарифовСтраховыхВзносовУНФ КАК ВидыТарифовСтраховыхВзносовУНФ
	|ГДЕ
	|	ВидыТарифовСтраховыхВзносовУНФ.Ссылка = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносовУНФ.ИндивидуальныйПредпринимательПрименяющийПатент)
	|	И ВидыТарифовСтраховыхВзносовУНФ.КодПФР2012 = """"
	|	И ВидыТарифовСтраховыхВзносовУНФ.КодФСС2012 = """"";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ВидТарифаОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ЗаполнитьЗначенияСвойств(ВидТарифаОбъект,Выборка,,"Ссылка");
		ВидТарифаОбъект.ДополнительныеСвойства.Вставить("ЗаписьОбщихДанных");
		ВидТарифаОбъект.Записать();
	КонецЦикла;

КонецПроцедуры

Процедура ВписатьКодыТарифов2015Года()
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВидыТарифовСтраховыхВзносовУНФ.Ссылка,
	|	""23"" КАК КодПФР2012,
	|	""181"" КАК КодФСС2012
	|ИЗ
	|	Справочник.ВидыТарифовСтраховыхВзносовУНФ КАК ВидыТарифовСтраховыхВзносовУНФ
	|ГДЕ
	|	ВидыТарифовСтраховыхВзносовУНФ.Ссылка = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносовУНФ.УчастникОсобойЗоныВКрыму)
	|	И ВидыТарифовСтраховыхВзносовУНФ.КодПФР2012 = """"
	|	И ВидыТарифовСтраховыхВзносовУНФ.КодФСС2012 = """"
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВидыТарифовСтраховыхВзносовУНФ.Ссылка,
	|	""24"",
	|	""191""
	|ИЗ
	|	Справочник.ВидыТарифовСтраховыхВзносовУНФ КАК ВидыТарифовСтраховыхВзносовУНФ
	|ГДЕ
	|	ВидыТарифовСтраховыхВзносовУНФ.Ссылка = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносовУНФ.РезидентТерриторииОпережающегоСоциальноЭкономическогоРазвития)
	|	И ВидыТарифовСтраховыхВзносовУНФ.КодПФР2012 = """"
	|	И ВидыТарифовСтраховыхВзносовУНФ.КодФСС2012 = """"";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ВидТарифаОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ЗаполнитьЗначенияСвойств(ВидТарифаОбъект,Выборка,,"Ссылка");
		ВидТарифаОбъект.ДополнительныеСвойства.Вставить("ЗаписьОбщихДанных");
		ВидТарифаОбъект.Записать();
	КонецЦикла;

КонецПроцедуры	

Процедура ОписатьТарифРезидентаПортаВладивосток()

	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВидыТарифовСтраховыхВзносовУНФ.Ссылка,
	|	""25"" КАК КодПФР2012,
	|	""201"" КАК КодФСС2012
	|ИЗ
	|	Справочник.ВидыТарифовСтраховыхВзносовУНФ КАК ВидыТарифовСтраховыхВзносовУНФ
	|ГДЕ
	|	ВидыТарифовСтраховыхВзносовУНФ.Ссылка = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносовУНФ.РезидентПортаВладивосток)
	|	И ВидыТарифовСтраховыхВзносовУНФ.КодПФР2012 = """"
	|	И ВидыТарифовСтраховыхВзносовУНФ.КодФСС2012 = """"";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ВидТарифаОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ЗаполнитьЗначенияСвойств(ВидТарифаОбъект,Выборка,,"Ссылка");
		ВидТарифаОбъект.ДополнительныеСвойства.Вставить("ЗаписьОбщихДанных");
		ВидТарифаОбъект.Записать();
	КонецЦикла;

КонецПроцедуры

Процедура ВписатьКодыФНС()
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВидыТарифовСтраховыхВзносовУНФ.Ссылка,
	|	ВЫБОР
	|		КОГДА ВидыТарифовСтраховыхВзносовУНФ.Ссылка = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносовУНФ.УпрощенныйНалоговыйРежим)
	|			ТОГДА ""02""
	|		КОГДА ВидыТарифовСтраховыхВзносовУНФ.Ссылка = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносовУНФ.ЕНВД)
	|			ТОГДА ""03""
	|		КОГДА ВидыТарифовСтраховыхВзносовУНФ.Ссылка = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносовУНФ.ХозОбществаБюджетныхВУЗов)
	|			ТОГДА ""04""
	|		КОГДА ВидыТарифовСтраховыхВзносовУНФ.Ссылка = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносовУНФ.РезидентТехникоВнедренческойЗоны)
	|			ТОГДА ""05""
	|		КОГДА ВидыТарифовСтраховыхВзносовУНФ.Ссылка = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносовУНФ.ITОрганизации)
	|			ТОГДА ""06""
	|		КОГДА ВидыТарифовСтраховыхВзносовУНФ.Ссылка = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносовУНФ.ДляЧленовЭкипажейМорскихСудовПодФлагомРФ)
	|			ТОГДА ""07""
	|		КОГДА ВидыТарифовСтраховыхВзносовУНФ.Ссылка = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносовУНФ.УпрощенныйНалоговыйРежимПроизводство)
	|			ТОГДА ""08""
	|		КОГДА ВидыТарифовСтраховыхВзносовУНФ.Ссылка = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносовУНФ.ДляФармацевтовАптек)
	|			ТОГДА ""09""
	|		КОГДА ВидыТарифовСтраховыхВзносовУНФ.Ссылка = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносовУНФ.НекоммерческиеОрганизации)
	|			ТОГДА ""10""
	|		КОГДА ВидыТарифовСтраховыхВзносовУНФ.Ссылка = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносовУНФ.БлаготворительныеОрганизации)
	|			ТОГДА ""11""
	|		КОГДА ВидыТарифовСтраховыхВзносовУНФ.Ссылка = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносовУНФ.ИндивидуальныйПредпринимательПрименяющийПатент)
	|			ТОГДА ""12""
	|		КОГДА ВидыТарифовСтраховыхВзносовУНФ.Ссылка = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносовУНФ.УчастникПроектаИнновационныйЦентрСколково)
	|			ТОГДА ""13""
	|		КОГДА ВидыТарифовСтраховыхВзносовУНФ.Ссылка = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносовУНФ.УчастникОсобойЗоныВКрыму)
	|			ТОГДА ""14""
	|		КОГДА ВидыТарифовСтраховыхВзносовУНФ.Ссылка = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносовУНФ.РезидентТерриторииОпережающегоСоциальноЭкономическогоРазвития)
	|			ТОГДА ""15""
	|		КОГДА ВидыТарифовСтраховыхВзносовУНФ.Ссылка = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносовУНФ.РезидентПортаВладивосток)
	|			ТОГДА ""16""
	|		ИНАЧЕ ""01""
	|	КОНЕЦ КАК КодФНС
	|ИЗ
	|	Справочник.ВидыТарифовСтраховыхВзносовУНФ КАК ВидыТарифовСтраховыхВзносовУНФ
	|ГДЕ
	|	ВидыТарифовСтраховыхВзносовУНФ.КодФНС = """"";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ВидТарифаОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ЗаполнитьЗначенияСвойств(ВидТарифаОбъект,Выборка, "КодФНС");
		ВидТарифаОбъект.ДополнительныеСвойства.Вставить("ЗаписьОбщихДанных");
		ВидТарифаОбъект.Записать();
	КонецЦикла;

КонецПроцедуры	

Процедура ОписатьТарифМультипликаторов() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВидыТарифовСтраховыхВзносовУНФ.Ссылка КАК Ссылка,
	|	ВидыТарифовСтраховыхВзносовУНФ.КодФНС КАК КодФНС
	|ИЗ
	|	Справочник.ВидыТарифовСтраховыхВзносовУНФ КАК ВидыТарифовСтраховыхВзносовУНФ
	|ГДЕ
	|	ВидыТарифовСтраховыхВзносовУНФ.ИмяПредопределенныхДанных = ""Мультипликаторы""";
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		ВидТарифаОбъект = Справочники.ВидыТарифовСтраховыхВзносовУНФ.СоздатьЭлемент();
		ВидТарифаОбъект.ИмяПредопределенныхДанных = "Мультипликаторы";
		ВидТарифаОбъект.Наименование = НСтр("ru='Организации-производители анимации'");
		ВидТарифаОбъект.КодФНС = "18";
		ВидТарифаОбъект.ОбменДанными.Загрузка = Истина;
		ВидТарифаОбъект.ДополнительныеСвойства.Вставить("ЗаписьОбщихДанных");
		ВидТарифаОбъект.Записать();
	Иначе
		Выборка = Результат.Выбрать();
		Выборка.Следующий(); 
		Если Выборка.КодФНС <> "18" Тогда
			ВидТарифаОбъект = Выборка.Ссылка.ПолучитьОбъект();
			ВидТарифаОбъект.КодФНС = "18";
			ВидТарифаОбъект.ДополнительныеСвойства.Вставить("ЗаписьОбщихДанных");
			ВидТарифаОбъект.Записать();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОписатьКалининградскийТариф() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВидыТарифовСтраховыхВзносовУНФ.Ссылка КАК Ссылка,
	|	ВидыТарифовСтраховыхВзносовУНФ.КодФНС КАК КодФНС
	|ИЗ
	|	Справочник.ВидыТарифовСтраховыхВзносовУНФ КАК ВидыТарифовСтраховыхВзносовУНФ
	|ГДЕ
	|	ВидыТарифовСтраховыхВзносовУНФ.ИмяПредопределенныхДанных = ""РезидентОсобойЗоныВКалининградскойОбласти""";
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		ВидТарифаОбъект = Справочники.ВидыТарифовСтраховыхВзносовУНФ.СоздатьЭлемент();
		ВидТарифаОбъект.ИмяПредопределенныхДанных = "РезидентОсобойЗоныВКалининградскойОбласти";
		ВидТарифаОбъект.Наименование = НСтр("ru='Резидент особой зоны в Калининградской области'");
		ВидТарифаОбъект.КодФНС = "17";
		ВидТарифаОбъект.ПрименяетсяПоОтдельнымДоходам = Истина;
		ВидТарифаОбъект.ЯвляетсяТерриториальнымТарифом = Истина;
		ВидТарифаОбъект.ОбменДанными.Загрузка = Истина;
		ВидТарифаОбъект.ДополнительныеСвойства.Вставить("ЗаписьОбщихДанных");
		ВидТарифаОбъект.Записать();
	Иначе
		Выборка = Результат.Выбрать();
		Выборка.Следующий(); 
		Если Выборка.КодФНС <> "17" Тогда
			ВидТарифаОбъект = Выборка.Ссылка.ПолучитьОбъект();
			ВидТарифаОбъект.КодФНС = "17";
			ВидТарифаОбъект.ПрименяетсяПоОтдельнымДоходам = Истина;
			ВидТарифаОбъект.ЯвляетсяТерриториальнымТарифом = Истина;
			ВидТарифаОбъект.ДополнительныеСвойства.Вставить("ЗаписьОбщихДанных");
			ВидТарифаОбъект.Записать();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОтметитьТерриториальныеТарифы() Экспорт

	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВидыТарифовСтраховыхВзносовУНФ.Ссылка КАК Ссылка,
	|	ИСТИНА КАК ЯвляетсяТерриториальнымТарифом
	|ИЗ
	|	Справочник.ВидыТарифовСтраховыхВзносовУНФ КАК ВидыТарифовСтраховыхВзносовУНФ
	|ГДЕ
	|	ВидыТарифовСтраховыхВзносовУНФ.Ссылка В (ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносовУНФ.РезидентПортаВладивосток), ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносовУНФ.УчастникОсобойЗоныВКрыму), ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносовУНФ.РезидентТерриторииОпережающегоСоциальноЭкономическогоРазвития), ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносовУНФ.РезидентТехникоВнедренческойЗоны), ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносовУНФ.ДляЧленовЭкипажейМорскихСудовПодФлагомРФ))
	|	И НЕ ВидыТарифовСтраховыхВзносовУНФ.ЯвляетсяТерриториальнымТарифом";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ВидТарифаОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ЗаполнитьЗначенияСвойств(ВидТарифаОбъект,Выборка, "ЯвляетсяТерриториальнымТарифом");
		ВидТарифаОбъект.ДополнительныеСвойства.Вставить("ЗаписьОбщихДанных");
		ВидТарифаОбъект.Записать();
	КонецЦикла;

КонецПроцедуры

Процедура ОписатьОффшорныйТариф() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВидыТарифовСтраховыхВзносовУНФ.Ссылка КАК Ссылка,
	|	ВидыТарифовСтраховыхВзносовУНФ.КодФНС КАК КодФНС
	|ИЗ
	|	Справочник.ВидыТарифовСтраховыхВзносовУНФ КАК ВидыТарифовСтраховыхВзносовУНФ
	|ГДЕ
	|	ВидыТарифовСтраховыхВзносовУНФ.ИмяПредопределенныхДанных = ""УчастникСпециальныхАдминистративныхРайонов""";
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		ВидТарифаОбъект = Справочники.ВидыТарифовСтраховыхВзносовУНФ.СоздатьЭлемент();
		ВидТарифаОбъект.ИмяПредопределенныхДанных = "УчастникСпециальныхАдминистративныхРайонов";
		ВидТарифаОбъект.Наименование = НСтр("ru='Участник специальных административных районов'");
		ВидТарифаОбъект.КодФНС = "19";
		ВидТарифаОбъект.ПрименяетсяПоОтдельнымДоходам = Истина;
		ВидТарифаОбъект.ЯвляетсяТерриториальнымТарифом = Истина;
		ВидТарифаОбъект.ОбменДанными.Загрузка = Истина;
		ВидТарифаОбъект.ДополнительныеСвойства.Вставить("ЗаписьОбщихДанных");
		ВидТарифаОбъект.Записать();
	Иначе
		Выборка = Результат.Выбрать();
		Выборка.Следующий(); 
		Если Выборка.КодФНС <> "19" Тогда
			ВидТарифаОбъект = Выборка.Ссылка.ПолучитьОбъект();
			ВидТарифаОбъект.КодФНС = "19";
			ВидТарифаОбъект.ПрименяетсяПоОтдельнымДоходам = Истина;
			ВидТарифаОбъект.ЯвляетсяТерриториальнымТарифом = Истина;
			ВидТарифаОбъект.ДополнительныеСвойства.Вставить("ЗаписьОбщихДанных");
			ВидТарифаОбъект.Записать();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОписатьТарифМалогоПредпринимательства() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВидыТарифовСтраховыхВзносовУНФ.Ссылка КАК Ссылка,
	|	ВидыТарифовСтраховыхВзносовУНФ.КодФНС КАК КодФНС
	|ИЗ
	|	Справочник.ВидыТарифовСтраховыхВзносовУНФ КАК ВидыТарифовСтраховыхВзносовУНФ
	|ГДЕ
	|	ВидыТарифовСтраховыхВзносовУНФ.ИмяПредопределенныхДанных = ""ДляСубъектовМалогоПредпринимательства""";
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		ВидТарифаОбъект = Справочники.ВидыТарифовСтраховыхВзносовУНФ.СоздатьЭлемент();
		ВидТарифаОбъект.ИмяПредопределенныхДанных = "ДляСубъектовМалогоПредпринимательства";
		ВидТарифаОбъект.Наименование = НСтр("ru='Для субъектов малого или среднего предпринимательства'");
		ВидТарифаОбъект.КодФНС = "20";
		ВидТарифаОбъект.ПрименяетсяПоОтдельнымДоходам = Ложь;
		ВидТарифаОбъект.ЯвляетсяТерриториальнымТарифом = Ложь;
		ВидТарифаОбъект.ОбменДанными.Загрузка = Истина;
		ВидТарифаОбъект.ДополнительныеСвойства.Вставить("ЗаписьОбщихДанных");
		ВидТарифаОбъект.Записать();
	Иначе
		Выборка = Результат.Выбрать();
		Выборка.Следующий(); 
		Если Выборка.КодФНС <> "20" Тогда
			ВидТарифаОбъект = Выборка.Ссылка.ПолучитьОбъект();
			ВидТарифаОбъект.КодФНС = "20";
			ВидТарифаОбъект.ПрименяетсяПоОтдельнымДоходам = Ложь;
			ВидТарифаОбъект.ЯвляетсяТерриториальнымТарифом = Ложь;
			ВидТарифаОбъект.ДополнительныеСвойства.Вставить("ЗаписьОбщихДанных");
			ВидТарифаОбъект.Записать();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОписатьНулевойКоронавирусныйТариф() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВидыТарифовСтраховыхВзносовУНФ.Ссылка КАК Ссылка,
	|	ВидыТарифовСтраховыхВзносовУНФ.КодФНС КАК КодФНС
	|ИЗ
	|	Справочник.ВидыТарифовСтраховыхВзносовУНФ КАК ВидыТарифовСтраховыхВзносовУНФ
	|ГДЕ
	|	ВидыТарифовСтраховыхВзносовУНФ.ИмяПредопределенныхДанных = ""ДляОтраслейПострадавшихОтКоронавируснойИнфекции""";
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		ВидТарифаОбъект = Справочники.ВидыТарифовСтраховыхВзносовУНФ.СоздатьЭлемент();
		ВидТарифаОбъект.ИмяПредопределенныхДанных = "ДляОтраслейПострадавшихОтКоронавируснойИнфекции";
		ВидТарифаОбъект.Наименование = НСтр("ru='Для отраслей, пострадавших от коронавирусной инфекции'");
		ВидТарифаОбъект.КодФНС = "21";
		ВидТарифаОбъект.ПрименяетсяПоОтдельнымДоходам = Ложь;
		ВидТарифаОбъект.ЯвляетсяТерриториальнымТарифом = Ложь;
		ВидТарифаОбъект.ОбменДанными.Загрузка = Истина;
		ВидТарифаОбъект.ДополнительныеСвойства.Вставить("ЗаписьОбщихДанных");
		ВидТарифаОбъект.Записать();
	Иначе
		Выборка = Результат.Выбрать();
		Выборка.Следующий(); 
		Если Выборка.КодФНС <> "21" Тогда
			ВидТарифаОбъект = Выборка.Ссылка.ПолучитьОбъект();
			ВидТарифаОбъект.КодФНС = "21";
			ВидТарифаОбъект.ПрименяетсяПоОтдельнымДоходам = Ложь;
			ВидТарифаОбъект.ЯвляетсяТерриториальнымТарифом = Ложь;
			ВидТарифаОбъект.ДополнительныеСвойства.Вставить("ЗаписьОбщихДанных");
			ВидТарифаОбъект.Записать();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОписатьТарифРазработчиковЭлектроннойПродукции() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВидыТарифовСтраховыхВзносовУНФ.Ссылка КАК Ссылка,
	|	ВидыТарифовСтраховыхВзносовУНФ.КодФНС КАК КодФНС
	|ИЗ
	|	Справочник.ВидыТарифовСтраховыхВзносовУНФ КАК ВидыТарифовСтраховыхВзносовУНФ
	|ГДЕ
	|	ВидыТарифовСтраховыхВзносовУНФ.ИмяПредопределенныхДанных = ""ОрганизацииРазработчикиЭлектроннойПродукции""";
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		ВидТарифаОбъект = Справочники.ВидыТарифовСтраховыхВзносовУНФ.СоздатьЭлемент();
		ВидТарифаОбъект.ИмяПредопределенныхДанных = "ОрганизацииРазработчикиЭлектроннойПродукции";
		ВидТарифаОбъект.Наименование = НСтр("ru='Организации-разработчики электронной продукции'");
		ВидТарифаОбъект.КодФНС = "22";
		ВидТарифаОбъект.ПрименяетсяПоОтдельнымДоходам = Ложь;
		ВидТарифаОбъект.ЯвляетсяТерриториальнымТарифом = Ложь;
		ВидТарифаОбъект.ОбменДанными.Загрузка = Истина;
		ВидТарифаОбъект.ДополнительныеСвойства.Вставить("ЗаписьОбщихДанных");
		ВидТарифаОбъект.Записать();
	Иначе
		Выборка = Результат.Выбрать();
		Выборка.Следующий(); 
		Если Выборка.КодФНС <> "22" Тогда
			ВидТарифаОбъект = Выборка.Ссылка.ПолучитьОбъект();
			ВидТарифаОбъект.КодФНС = "22";
			ВидТарифаОбъект.ПрименяетсяПоОтдельнымДоходам = Ложь;
			ВидТарифаОбъект.ЯвляетсяТерриториальнымТарифом = Ложь;
			ВидТарифаОбъект.ДополнительныеСвойства.Вставить("ЗаписьОбщихДанных");
			ВидТарифаОбъект.Записать();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОписатьТарифы2022() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВидыТарифовСтраховыхВзносовУНФ.Ссылка КАК Ссылка,
	|	ВидыТарифовСтраховыхВзносовУНФ.КодФНС КАК КодФНС
	|ИЗ
	|	Справочник.ВидыТарифовСтраховыхВзносовУНФ КАК ВидыТарифовСтраховыхВзносовУНФ
	|ГДЕ
	|	ВидыТарифовСтраховыхВзносовУНФ.ИмяПредопределенныхДанных = ""ИнновационныеНаучноТехнологическиеЦентры""";
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		ВидТарифаОбъект = Справочники.ВидыТарифовСтраховыхВзносовУНФ.СоздатьЭлемент();
		ВидТарифаОбъект.ИмяПредопределенныхДанных = "ИнновационныеНаучноТехнологическиеЦентры";
		ВидТарифаОбъект.Наименование = НСтр("ru='Организации, получившие статус участников инновационных научно-технологических центров'");
		ВидТарифаОбъект.КодФНС = "23";
		ВидТарифаОбъект.ПрименяетсяПоОтдельнымДоходам = Ложь;
		ВидТарифаОбъект.ЯвляетсяТерриториальнымТарифом = Ложь;
		ВидТарифаОбъект.ОбменДанными.Загрузка = Истина;
		ВидТарифаОбъект.ДополнительныеСвойства.Вставить("ЗаписьОбщихДанных");
		ВидТарифаОбъект.Записать();
	Иначе
		Выборка = Результат.Выбрать();
		Выборка.Следующий(); 
		Если Выборка.КодФНС <> "23" Тогда
			ВидТарифаОбъект = Выборка.Ссылка.ПолучитьОбъект();
			ВидТарифаОбъект.КодФНС = "23";
			ВидТарифаОбъект.ПрименяетсяПоОтдельнымДоходам = Ложь;
			ВидТарифаОбъект.ЯвляетсяТерриториальнымТарифом = Ложь;
			ВидТарифаОбъект.ДополнительныеСвойства.Вставить("ЗаписьОбщихДанных");
			ВидТарифаОбъект.Записать();
		КонецЕсли;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВидыТарифовСтраховыхВзносовУНФ.Ссылка КАК Ссылка,
	|	ВидыТарифовСтраховыхВзносовУНФ.КодФНС КАК КодФНС
	|ИЗ
	|	Справочник.ВидыТарифовСтраховыхВзносовУНФ КАК ВидыТарифовСтраховыхВзносовУНФ
	|ГДЕ
	|	ВидыТарифовСтраховыхВзносовУНФ.ИмяПредопределенныхДанных = ""ОрганизацииЗанимающиесяОбщепитом""";
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		ВидТарифаОбъект = Справочники.ВидыТарифовСтраховыхВзносовУНФ.СоздатьЭлемент();
		ВидТарифаОбъект.ИмяПредопределенныхДанных = "ОрганизацииЗанимающиесяОбщепитом";
		ВидТарифаОбъект.Наименование = НСтр("ru='Организации, занимающиеся общепитом'");
		ВидТарифаОбъект.КодФНС = "24";
		ВидТарифаОбъект.ПрименяетсяПоОтдельнымДоходам = Ложь;
		ВидТарифаОбъект.ЯвляетсяТерриториальнымТарифом = Ложь;
		ВидТарифаОбъект.ОбменДанными.Загрузка = Истина;
		ВидТарифаОбъект.ДополнительныеСвойства.Вставить("ЗаписьОбщихДанных");
		ВидТарифаОбъект.Записать();
	Иначе
		Выборка = Результат.Выбрать();
		Выборка.Следующий(); 
		Если Выборка.КодФНС <> "24" Тогда
			ВидТарифаОбъект = Выборка.Ссылка.ПолучитьОбъект();
			ВидТарифаОбъект.КодФНС = "24";
			ВидТарифаОбъект.ПрименяетсяПоОтдельнымДоходам = Ложь;
			ВидТарифаОбъект.ЯвляетсяТерриториальнымТарифом = Ложь;
			ВидТарифаОбъект.ДополнительныеСвойства.Вставить("ЗаписьОбщихДанных");
			ВидТарифаОбъект.Записать();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОписатьТарифОрганизацийКурильскихОстровов() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВидыТарифовСтраховыхВзносовУНФ.Ссылка КАК Ссылка,
	|	ВидыТарифовСтраховыхВзносовУНФ.КодФНС КАК КодФНС
	|ИЗ
	|	Справочник.ВидыТарифовСтраховыхВзносовУНФ КАК ВидыТарифовСтраховыхВзносовУНФ
	|ГДЕ
	|	ВидыТарифовСтраховыхВзносовУНФ.ИмяПредопределенныхДанных = ""ОрганизацииКурильскихОстровов""";
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		ВидТарифаОбъект = Справочники.ВидыТарифовСтраховыхВзносовУНФ.СоздатьЭлемент();
		ВидТарифаОбъект.ИмяПредопределенныхДанных = "ОрганизацииКурильскихОстровов";
		ВидТарифаОбъект.Наименование = НСтр("ru='Организации, зарегистрированные на Курильских островах'");
		ВидТарифаОбъект.КодФНС = "25";
		ВидТарифаОбъект.ПрименяетсяПоОтдельнымДоходам = Ложь;
		ВидТарифаОбъект.ЯвляетсяТерриториальнымТарифом = Ложь;
		ВидТарифаОбъект.ОбменДанными.Загрузка = Истина;
		ВидТарифаОбъект.ДополнительныеСвойства.Вставить("ЗаписьОбщихДанных");
		ВидТарифаОбъект.Записать();
	Иначе
		Выборка = Результат.Выбрать();
		Выборка.Следующий(); 
		Если Выборка.КодФНС <> "25" Тогда
			ВидТарифаОбъект = Выборка.Ссылка.ПолучитьОбъект();
			ВидТарифаОбъект.КодФНС = "25";
			ВидТарифаОбъект.ПрименяетсяПоОтдельнымДоходам = Ложь;
			ВидТарифаОбъект.ЯвляетсяТерриториальнымТарифом = Ложь;
			ВидТарифаОбъект.ДополнительныеСвойства.Вставить("ЗаписьОбщихДанных");
			ВидТарифаОбъект.Записать();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОписатьТарифАУСН() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВидыТарифовСтраховыхВзносовУНФ.Ссылка КАК Ссылка,
	|	ВидыТарифовСтраховыхВзносовУНФ.КодФНС КАК КодФНС
	|ИЗ
	|	Справочник.ВидыТарифовСтраховыхВзносовУНФ КАК ВидыТарифовСтраховыхВзносовУНФ
	|ГДЕ
	|	ВидыТарифовСтраховыхВзносовУНФ.ИмяПредопределенныхДанных = ""АУСН""";
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		ВидТарифаОбъект = Справочники.ВидыТарифовСтраховыхВзносовУНФ.СоздатьЭлемент();
		ВидТарифаОбъект.ИмяПредопределенныхДанных = "АУСН";
		ВидТарифаОбъект.Наименование = НСтр("ru='Страхователи, применяющие Автоматизированную УСН'");
		ВидТарифаОбъект.КодФНС = "АУ";
		ВидТарифаОбъект.ПрименяетсяПоОтдельнымДоходам = Ложь;
		ВидТарифаОбъект.ЯвляетсяТерриториальнымТарифом = Ложь;
		ВидТарифаОбъект.ОбменДанными.Загрузка = Истина;
		ВидТарифаОбъект.ДополнительныеСвойства.Вставить("ЗаписьОбщихДанных");
		ВидТарифаОбъект.Записать();
	Иначе
		Выборка = Результат.Выбрать();
		Выборка.Следующий(); 
		Если Выборка.КодФНС <> "АУ" Тогда
			ВидТарифаОбъект = Выборка.Ссылка.ПолучитьОбъект();
			ВидТарифаОбъект.КодФНС = "АУ";
			ВидТарифаОбъект.ПрименяетсяПоОтдельнымДоходам = Ложь;
			ВидТарифаОбъект.ЯвляетсяТерриториальнымТарифом = Ложь;
			ВидТарифаОбъект.ДополнительныеСвойства.Вставить("ЗаписьОбщихДанных");
			ВидТарифаОбъект.Записать();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОписатьТарифСтудентов() Экспорт
	
	// АПК:1036-выкл
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВидыТарифовСтраховыхВзносовУНФ.Ссылка КАК Ссылка,
	|	ВидыТарифовСтраховыхВзносовУНФ.КодФНС КАК КодФНС
	|ИЗ
	|	Справочник.ВидыТарифовСтраховыхВзносовУНФ КАК ВидыТарифовСтраховыхВзносовУНФ
	|ГДЕ
	|	ВидыТарифовСтраховыхВзносовУНФ.ИмяПредопределенныхДанных = ""ДляСтудентовВСтудотрядах""";
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		ВидТарифаОбъект = Справочники.ВидыТарифовСтраховыхВзносовУНФ.СоздатьЭлемент();
		ВидТарифаОбъект.ИмяПредопределенныхДанных = "ДляСтудентовВСтудотрядах";
		ВидТарифаОбъект.Наименование = НСтр("ru='По доходам студентов в студотрядах'");
		ВидТарифаОбъект.КодФНС = "26";
		ВидТарифаОбъект.ПрименяетсяПоОтдельнымДоходам = Истина;
		ВидТарифаОбъект.ЯвляетсяТерриториальнымТарифом = Ложь;
		ВидТарифаОбъект.ЯвляетсяТарифомДляМСП = Ложь;
		ВидТарифаОбъект.РеквизитДопУпорядочивания = 33;
		ВидТарифаОбъект.ОбменДанными.Загрузка = Истина;
		ВидТарифаОбъект.ДополнительныеСвойства.Вставить("ЗаписьОбщихДанных");
		ВидТарифаОбъект.Записать();
	Иначе
		Выборка = Результат.Выбрать();
		Выборка.Следующий(); 
		Если Выборка.КодФНС <> "26" Тогда
			ВидТарифаОбъект = Выборка.Ссылка.ПолучитьОбъект();
			ВидТарифаОбъект.КодФНС = "26";
			ВидТарифаОбъект.ПрименяетсяПоОтдельнымДоходам = Истина;
			ВидТарифаОбъект.ЯвляетсяТерриториальнымТарифом = Ложь;
			ВидТарифаОбъект.ЯвляетсяТарифомДляМСП = Ложь;
			ВидТарифаОбъект.РеквизитДопУпорядочивания = 33;
			ВидТарифаОбъект.ДополнительныеСвойства.Вставить("ЗаписьОбщихДанных");
			ВидТарифаОбъект.Записать();
		КонецЕсли;
	КонецЕсли;
	// АПК:1036 - вкл
	
КонецПроцедуры

Процедура ОписатьТарифыМСП()Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВидыТарифовСтраховыхВзносовУНФ.Ссылка КАК Ссылка,
	|	ДАТАВРЕМЯ(2020, 1, 1, 0, 0, 0) КАК ЯвляетсяТарифомДляМСП
	|ИЗ
	|	Справочник.ВидыТарифовСтраховыхВзносовУНФ КАК ВидыТарифовСтраховыхВзносовУНФ
	|ГДЕ
	|	ВидыТарифовСтраховыхВзносовУНФ.ИмяПредопределенныхДанных = ""ДляСубъектовМалогоПредпринимательства""
	|	И ВидыТарифовСтраховыхВзносовУНФ.ЯвляетсяТарифомДляМСП = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВидыТарифовСтраховыхВзносовУНФ.Ссылка,
	|	ДАТАВРЕМЯ(2020, 1, 1, 0, 0, 0)
	|ИЗ
	|	Справочник.ВидыТарифовСтраховыхВзносовУНФ КАК ВидыТарифовСтраховыхВзносовУНФ
	|ГДЕ
	|	ВидыТарифовСтраховыхВзносовУНФ.ИмяПредопределенныхДанных = ""ОрганизацииЗанимающиесяОбщепитом""
	|	И ВидыТарифовСтраховыхВзносовУНФ.ЯвляетсяТарифомДляМСП = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВидыТарифовСтраховыхВзносовУНФ.Ссылка,
	|	ДАТАВРЕМЯ(2023, 1, 1, 0, 0, 0)
	|ИЗ
	|	Справочник.ВидыТарифовСтраховыхВзносовУНФ КАК ВидыТарифовСтраховыхВзносовУНФ
	|ГДЕ
	|	ВидыТарифовСтраховыхВзносовУНФ.ИмяПредопределенныхДанных = ""УчастникПроектаИнновационныйЦентрСколково""
	|	И ВидыТарифовСтраховыхВзносовУНФ.ЯвляетсяТарифомДляМСП = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВидыТарифовСтраховыхВзносовУНФ.Ссылка,
	|	ДАТАВРЕМЯ(2023, 1, 1, 0, 0, 0)
	|ИЗ
	|	Справочник.ВидыТарифовСтраховыхВзносовУНФ КАК ВидыТарифовСтраховыхВзносовУНФ
	|ГДЕ
	|	ВидыТарифовСтраховыхВзносовУНФ.ИмяПредопределенныхДанных = ""ИнновационныеНаучноТехнологическиеЦентры""
	|	И ВидыТарифовСтраховыхВзносовУНФ.ЯвляетсяТарифомДляМСП = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)";
	
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			ВидТарифаОбъект = Выборка.Ссылка.ПолучитьОбъект();
			ВидТарифаОбъект.ЯвляетсяТарифомДляМСП = Выборка.ЯвляетсяТарифомДляМСП;
			ВидТарифаОбъект.ДополнительныеСвойства.Вставить("ЗаписьОбщихДанных");
			ВидТарифаОбъект.Записать();
		КонецЦикла; 
	КонецЕсли;
	
КонецПроцедуры

// АПК:1327-вкл

Функция ОписаниеТарифа()
	
	Возврат Новый Структура("Идентификатор, Наименование, КодПФР2011, КодФСС2011");
	
КонецФункции	

#КонецОбласти

#КонецЕсли
